-- MySQL dump 10.13  Distrib 8.1.0, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: mapdb
-- ------------------------------------------------------
-- Server version	8.1.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `mapdata`
--

DROP TABLE IF EXISTS `mapdata`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `mapdata` (
  `title` varchar(255) NOT NULL,
  `type` varchar(50) NOT NULL,
  `time` time DEFAULT NULL,
  `longtitude` float DEFAULT NULL,
  `latitude` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mapdata`
--

LOCK TABLES `mapdata` WRITE;
/*!40000 ALTER TABLE `mapdata` DISABLE KEYS */;
INSERT INTO `mapdata` VALUES ('דודשאב תוקעזא','ALARMS','13:34:06',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:34:10',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:34:13',34.95,29.5438),('םיעגפנ וא תוליפנ לע תוחיש ןיא :ןולקשאב תוקעזאה','ALARMS','13:34:16',34.5743,31.6688),('תילוחמ דועית :םילבחמה יעונפוא','DANGER','13:34:18',0,0),('דודשאב תוקעזא','ALARMS','13:42:02',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:42:06',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:42:09',34.95,29.5438),('םיעגפנ וא תוליפנ לע תוחיש ןיא :ןולקשאב תוקעזאה','ALARMS','13:42:12',34.5743,31.6688),('תילוחמ דועית :םילבחמה יעונפוא','DANGER','13:42:14',0,0),('דודשאב תוקעזא','ALARMS','13:43:22',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:43:28',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:43:32',34.95,29.5438),('םיעגפנ וא תוליפנ לע תוחיש ןיא :ןולקשאב תוקעזאה','ALARMS','13:43:37',34.5743,31.6688),('תילוחמ דועית :םילבחמה יעונפוא','DANGER','13:43:42',0,0),('דודשאב תוקעזא','ALARMS','13:44:44',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:44:48',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:44:52',34.95,29.5438),('םיעגפנ וא תוליפנ לע תוחיש ןיא :ןולקשאב תוקעזאה','ALARMS','13:44:55',34.5743,31.6688),('תילוחמ דועית :םילבחמה יעונפוא','DANGER','13:44:57',0,0),('דודשאב תוקעזא','ALARMS','13:52:24',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:52:28',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:52:31',34.95,29.5438),('דודשאב תוקעזא','ALARMS','13:54:02',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:54:06',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:54:10',34.95,29.5438),('דודשאב תוקעזא','ALARMS','13:55:04',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:55:07',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:55:10',34.95,29.5438),('דודשאב תוקעזא','ALARMS','13:56:32',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:56:35',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:56:39',34.95,29.5438),('דודשאב תוקעזא','ALARMS','13:59:09',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','13:59:13',34.5956,31.5227),('הטילשב שאה יבכמ ,תליאב םירצמ ךרדב חותפ חטשב הפירש','ROAD_BLOCKED','13:59:17',34.95,29.5438),('הרהנמה שיבכב ינוניב חרואב עצפנ ריעצ :ירי עוגיפל דשח','DANGER','14:06:58',0,0),('דודשאב תוקעזא','ALARMS','14:07:05',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','14:07:09',34.5956,31.5227),('דודשאב םיניוע סיט ילכ תרידח לע הערתה :ףרועה דוקיפ','DANGER','14:11:26',34.6553,31.8044),('ףטועו ןולקשא ,דודשאב תוקעזא :ךשמנ חטמה','ALARMS','14:11:27',34.6553,31.8044),('הרהנמה שיבכב ינוניב חרואב עצפנ ריעצ :ירי עוגיפל דשח','DANGER','14:11:28',0,0),('דודשאב תוקעזא','ALARMS','14:11:35',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','14:11:38',34.5956,31.5227),('ןולקשא תרזגב תוקעזאל ןוכדע','ALARMS','14:12:54',34.5743,31.6688),('דודשאב םיניוע סיט ילכ תרידח לע הערתה :ףרועה דוקיפ','DANGER','14:12:55',34.6553,31.8044),('ףטועו ןולקשא ,דודשאב תוקעזא :ךשמנ חטמה','ALARMS','14:12:55',34.6553,31.8044),('הרהנמה שיבכב ינוניב חרואב עצפנ ריעצ :ירי עוגיפל דשח','DANGER','14:12:57',0,0),('דודשאב תוקעזא','ALARMS','14:13:03',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','14:13:07',34.5956,31.5227),('ןולקשא תרזגב תוקעזאל ןוכדע','ALARMS','14:14:08',34.5743,31.6688),('דודשאב םיניוע סיט ילכ תרידח לע הערתה :ףרועה דוקיפ','DANGER','14:14:08',34.6553,31.8044),('ףטועו ןולקשא ,דודשאב תוקעזא :ךשמנ חטמה','ALARMS','14:14:10',34.6553,31.8044),('הרהנמה שיבכב ינוניב חרואב עצפנ ריעצ :ירי עוגיפל דשח','DANGER','14:14:11',0,0),('דודשאב תוקעזא','ALARMS','14:14:18',34.6553,31.8044),('םיתבב רגתסהל ךרוצ ןיא ,רסוה תורדשב ינוחטיב עוריאל ששחה','DANGER','14:14:22',34.5956,31.5227);
/*!40000 ALTER TABLE `mapdata` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-10-11 14:59:28
